configuration/20201024181625-sudo.org
#+TITLE: sudo
[[file:20201024181648-editing.org][editing]]
[[file:20201024181712-permissions.org][permissions]]

** sudo-edit
#+BEGIN_SRC emacs-lisp :results silent
;; http://emacsredux.com/blog/2013/04/21/edit-files-as-root/
(defun sudo-edit (&optional arg)
  "Edit currently visited file as root.

With a prefix ARG prompt for a file to visit.
Will also prompt for a file to visit if current
buffer is not visiting a file."
  (interactive "P")
  (if (or arg (not buffer-file-name))
      (find-file (concat "/sudo:root@localhost:"
                         (ido-read-file-name "Find file(as root): ")))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
 

#+END_SRC









** read-only
;; read-only-buffer
;;http://stackoverflow.com/questions/180910/how-do-i-change-read-write-mode-for-a-file-using-emacs
;;C-x C-q
